In [1]:
#Exp no 5:

In [2]:
#Aim :

In [3]:
# Name :Durva Gajendra Waghmare
# Roll no:62
# Sec:A
# Subject:ET1(Emerging Technology 1)
# Data:25/8/2025

In [4]:
#importing the basic library
import pandas as pd

In [6]:
#Creating Data Frame
df=pd.DataFrame([[21,27,26,11],[11,25,26,27],[11,13,18,19]],
                columns=["CD","DBMS","DSS","CAO"])

In [7]:
df

   CD  DBMS  DSS  CAO
0  21    27   26   11
1  11    25   26   27
2  11    13   18   19

In [8]:
df.shape

(3, 4)

In [12]:
df.size

12

In [13]:
df.ndim

2

In [15]:
df2=pd.DataFrame([[22,12,27,27]],columns=["CD","DSS","CAO","DBMS"])

In [20]:
df3=df.append(df2,ignore_index=True)

In [21]:
df3

   CD  DBMS  DSS  CAO
0  21    27   26   11
1  11    25   26   27
2  11    13   18   19
3  22    27   12   27

# Adding Attribute

In [22]:
df3["DM"]=[12,14,15,16]

In [23]:
df3

   CD  DBMS  DSS  CAO  DM
0  21    27   26   11  12
1  11    25   26   27  14
2  11    13   18   19  15
3  22    27   12   27  16

# Delete Record from Frame

In [25]:
df4=df3.drop(index=[1])

In [26]:
df4

   CD  DBMS  DSS  CAO  DM
0  21    27   26   11  12
2  11    13   18   19  15
3  22    27   12   27  16

In [27]:
df5=df3.drop(columns=["DM"])

In [28]:
df5

   CD  DBMS  DSS  CAO
0  21    27   26   11
1  11    25   26   27
2  11    13   18   19
3  22    27   12   27

In [29]:
#finding mean for DSS
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 20.5

In [31]:
#finding mode for DSS
print("Mode of DSS:",df5["DSS"].mode())

Mode of DSS: 0    26
dtype: int64

In [33]:
#finding median for DSS
print("Median of DSS:",df5["DSS"].median())

Median of DSS: 22.0

In [34]:
#finding max for DSS
print("Max of DSS:",df5["DSS"].max())

Max of DSS: 26

In [35]:
#finding min for DSS
print("Min of DSS:",df5["DSS"].min())

Min of DSS: 12

In [41]:
name=["Durva","Anand","Om","Shamli","Abhi","Sayli"]
name

['Durva', 'Anand', 'Om', 'Shamli', 'Abhi', 'Sayli']

In [42]:
#Creating series
Roll_list=pd.Series(name,index=[1,2,3,4,5,6])
print(Roll_list)

1     Durva
2     Anand
3        Om
4    Shamli
5      Abhi
6     Sayli
dtype: object